Model: "cnn_landscape"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_3 (Batch multiple                  4         
_________________________________________________________________
residual (Sequential)        multiple                  330       
_________________________________________________________________
embedding (Sequential)       multiple                  2530      
_________________________________________________________________
conv1d_12 (Conv1D)           multiple                  505       
_________________________________________________________________
integral_weight (Sequential) multiple                  7460      
_________________________________________________________________
dense_4 (Dense)              multiple                  930       
_________________________________________________________________
dense_5 (Dense)              multiple                  930       
_________________________________________________________________
dense_6 (Dense)              multiple                  310       
_________________________________________________________________
dense_7 (Dense)              multiple                  11        
=================================================================
Total params: 13,010
Trainable params: 12,988
Non-trainable params: 22
_________________________________________________________________