Model: "cnn_landscape_W"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
residual (Sequential)        multiple                  42        
_________________________________________________________________
embedding (Sequential)       multiple                  1514      
_________________________________________________________________
conv1d_12 (Conv1D)           multiple                  505       
_________________________________________________________________
integral_weight (Sequential) multiple                  7460      
_________________________________________________________________
dense_4 (Dense)              multiple                  930       
_________________________________________________________________
dense_5 (Dense)              multiple                  930       
_________________________________________________________________
dense_6 (Dense)              multiple                  310       
_________________________________________________________________
dense_7 (Dense)              multiple                  11        
=================================================================
Total params: 11,702
Trainable params: 11,700
Non-trainable params: 2
_________________________________________________________________