Model: "discrete_10000_ec_2_VW"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential_18 (Sequential)   multiple                  561       
_________________________________________________________________
sequential_19 (Sequential)   multiple                  136       
_________________________________________________________________
sequential_20 (Sequential)   multiple                  264       
_________________________________________________________________
sequential_21 (Sequential)   multiple                  520       
_________________________________________________________________
sequential_22 (Sequential)   multiple                  1032      
_________________________________________________________________
sequential_23 (Sequential)   multiple                  2056      
_________________________________________________________________
sequential_24 (Sequential)   multiple                  4104      
_________________________________________________________________
sequential_25 (Sequential)   multiple                  8200      
_________________________________________________________________
dense_10 (Dense)             multiple                  9         
_________________________________________________________________
sequential_26 (Sequential)   multiple                  484       
_________________________________________________________________
dense_14 (Dense)             multiple                  8         
=================================================================
Total params: 17,374
Trainable params: 17,370
Non-trainable params: 4
_________________________________________________________________