Model: "discrete_10000_ec_2_W"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential_9 (Sequential)    multiple                  549       
_________________________________________________________________
sequential_10 (Sequential)   multiple                  136       
_________________________________________________________________
sequential_11 (Sequential)   multiple                  264       
_________________________________________________________________
sequential_12 (Sequential)   multiple                  520       
_________________________________________________________________
sequential_13 (Sequential)   multiple                  1032      
_________________________________________________________________
sequential_14 (Sequential)   multiple                  2056      
_________________________________________________________________
sequential_15 (Sequential)   multiple                  4104      
_________________________________________________________________
sequential_16 (Sequential)   multiple                  8200      
_________________________________________________________________
dense_5 (Dense)              multiple                  9         
_________________________________________________________________
sequential_17 (Sequential)   multiple                  484       
_________________________________________________________________
dense_9 (Dense)              multiple                  8         
=================================================================
Total params: 17,362
Trainable params: 17,358
Non-trainable params: 4
_________________________________________________________________