Model: "cnn_dense_0_V"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cnn_dense_0_V_layers (Sequen multiple                  8321      
=================================================================
Total params: 8,321
Trainable params: 8,269
Non-trainable params: 52
_________________________________________________________________