Model: "cnn_dense_0_VW"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cnn_dense_0_VW_layers (Seque multiple                  8489      
=================================================================
Total params: 8,489
Trainable params: 8,433
Non-trainable params: 56
_________________________________________________________________