Model: "test"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  10001     
=================================================================
Total params: 10,001
Trainable params: 10,001
Non-trainable params: 0
_________________________________________________________________