Model: "cnn_landscape_VW"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
residual (Sequential)        multiple                  164       
_________________________________________________________________
embedding (Sequential)       multiple                  1768      
_________________________________________________________________
conv1d_20 (Conv1D)           multiple                  755       
_________________________________________________________________
integral_weight (Sequential) multiple                  7460      
_________________________________________________________________
out_layer1 (Sequential)      multiple                  1860      
_________________________________________________________________
out_layer2 (Sequential)      multiple                  321       
=================================================================
Total params: 12,328
Trainable params: 12,324
Non-trainable params: 4
_________________________________________________________________