Model: "cnn_landscape_V"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
residual (Sequential)        multiple                  42        
_________________________________________________________________
embedding (Sequential)       multiple                  1514      
_________________________________________________________________
conv1d_4 (Conv1D)            multiple                  505       
_________________________________________________________________
integral_weight (Sequential) multiple                  7460      
_________________________________________________________________
dense (Dense)                multiple                  930       
_________________________________________________________________
dense_1 (Dense)              multiple                  930       
_________________________________________________________________
dense_2 (Dense)              multiple                  310       
_________________________________________________________________
dense_3 (Dense)              multiple                  11        
=================================================================
Total params: 11,702
Trainable params: 11,700
Non-trainable params: 2
_________________________________________________________________