Model: "cnn_landscape_VW"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
residual (Sequential)        multiple                  164       
_________________________________________________________________
embedding (Sequential)       multiple                  1768      
_________________________________________________________________
conv1d_20 (Conv1D)           multiple                  755       
_________________________________________________________________
integral_weight (Sequential) multiple                  7460      
_________________________________________________________________
dense_8 (Dense)              multiple                  930       
_________________________________________________________________
dense_9 (Dense)              multiple                  930       
_________________________________________________________________
dense_10 (Dense)             multiple                  310       
_________________________________________________________________
dense_11 (Dense)             multiple                  11        
=================================================================
Total params: 12,328
Trainable params: 12,324
Non-trainable params: 4
_________________________________________________________________