Model: "ec1_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential (Sequential)      multiple                  549       
_________________________________________________________________
sequential_1 (Sequential)    multiple                  136       
_________________________________________________________________
sequential_2 (Sequential)    multiple                  264       
_________________________________________________________________
sequential_3 (Sequential)    multiple                  520       
_________________________________________________________________
sequential_4 (Sequential)    multiple                  1032      
_________________________________________________________________
sequential_5 (Sequential)    multiple                  2056      
_________________________________________________________________
sequential_6 (Sequential)    multiple                  4104      
_________________________________________________________________
sequential_7 (Sequential)    multiple                  8200      
_________________________________________________________________
dense (Dense)                multiple                  9         
_________________________________________________________________
sequential_8 (Sequential)    multiple                  484       
_________________________________________________________________
dense_4 (Dense)              multiple                  8         
=================================================================
Total params: 17,362
Trainable params: 17,358
Non-trainable params: 4
_________________________________________________________________